Model: "variational_encoder_decoder"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 model (Functional)          ((None, 8),               19552     
                              (None, 8))                         
                                                                 
 model_1 (Functional)        (None, 2)                 19026     
                                                                 
=================================================================
Total params: 38578 (150.70 KB)
Trainable params: 37490 (146.45 KB)
Non-trainable params: 1088 (4.25 KB)
_________________________________________________________________
